# SetDLControlOffset

## Description
Sets the Double Line Preferences control offset.

```pascal
PROCEDURE SetDLControlOffset(controlOffsetDistance : REAL);
```

```python
def vs.SetDLControlOffset(controlOffsetDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|controlOffsetDistance|REAL|The control offset.|

## Remarks
CJG 6-27-06

## See Also
VS Functions:
GetDLControlOffset

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings